using System;
					
public class Program
{
	//Наш лабиринт - массив целочисленных значений
  //Обозначение:
  // -1 стенка
  //  0 проходы лабиринта
  // -5 и -10 вход и выход лабиринта
  static int[,] maze = new int[10,10]
	{
    {-1,-5,-1,-1,-1,-1,-1,-1,-1,-1},
    {-1,0,0,0,-1,-1,0,0,0,-1},
    {-1,-1,-1,0,0,-1,0,0,0,-1},
    {-1,0,-1,-1,0,-1,-1,-1,0,-1},
    {-1,0,0,0,0,0,0,0,0,-1},
    {-1,0,-1,-1,-1,-1,0,-1,-1,-1},
    {-1,0,0,0,0,-1,0,0,0,-1},
    {-1,-1,-1,0,-1,-1,0,-1,0,-1},
    {-1,0,0,0,0,0,0,-1,0,-1},
    {-1,-1,-1,-1,-1,-1,-1,-1,-10,-1},
	};
  //Вывод лабиринта на экран
	static void Main()
	{
		for(int i = 0; i<10; i++)
		{
			for(int j = 0; j<10; j++)
				Console.Write("{0,4}", maze[i,j]);
			Console.WriteLine();
		}
	}  
}